rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "me"]]
---
  def select_by_director
    #select movie by director
    @movie = Movie.find(params[:id])
    if @movie.director.blank?